#include "українська.з"
#include ввпотоки
#include вектори
#include <iomanip>
#include <windows.h>
використовувати простірімен стандартний;
ціла основна()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    ціле рядки = 0;
    ціле колонки = 7;
    насіння(час(0));
    // Це буде вектор векторів 
    вектор < вектор<цілі> > век;
    // Всі елементи будуть двозначними
    ціле число = 10;
    // Вставляємо елементи у вектор
    for (size_t g = 0; g < 3; g++)
    {
        if (g == 0)
        { 
            рядки = 0;
        }
        else if (g == 1)
        {
            рядки = 1;
        }
        else if (g == 2)
        {
            рядки = 4;
        }
        для(ціле i = 0; i < рядки; i++)
        {

            // Тимчасовий вектор для збереження елементів
            вектор<цілі> допоміжний;
            для(ціле ї = 0; ї < колонки; ї++)
            {
                допоміжний.дописати_кінець(число);
                число += випадковість() % 2 + 1;
            }
            // Двомірний вектор створюємо шляхом додавання до нього одномірного
            век.дописати_кінець(допоміжний);
        }
     
        ціла кількість_рядків = век.розмір();
      

        для(ціле i = 0; i < кількість_рядків; i++)
        {
            якщо(i % 2 == 0 або i == 0)
            {
                век[i].clear();
            }
        }
        // Виводимо таблицю на екран
        вивести << g << "Оновлений двомірний вектор:" << кр;
        для(ціле i = 0; i < кількість_рядків; i++)
        {
            для(ціле ї = 0; ї < век[i].розмір(); ї++)
            {
                вивести << setw(3) << век[i][ї] << " ";
            }
            вивести << кр;
        }
    }
    
}
